#+title: 长度最小的子数组

* 209.长度最小的子数组

#+begin_src go :main no
  package main

  import (
      "fmt"
      "math"
  )

  func main() {
      fmt.Println(minSubArrayLen(7, []int{2, 3, 1, 2, 4, 3}))
  }

  func minSubArrayLen(target int, nums []int) int {
      n := len(nums)

      if n == 0 {
          return 0
      }

      s, e := 0, 0

      ans := math.MaxInt32

      sum := 0

      for e < n {
          sum += nums[e]

          for sum >= target {
              ans = min(ans, e-s+1)
              sum -= nums[s]
              s++
          }
          e++
      }

      if ans == math.MaxInt32 {
          return 0
      }

      return ans

  }

  func min(x, y int) int {
      if x < y {
          return x
      }
      return y
  }
#+end_src

#+RESULTS:
: 2

滑动窗口

* 904. 水果成篮

#+begin_src go :main no
  package main

  import "fmt"

  func main() {
      fmt.Println(totalFruit([]int{1, 2, 3, 2, 2}))
  }

  func totalFruit(fruits []int) int {
      f := map[int]int{}

      i, j, res, n := 0, 0, 0, len(fruits)

      for ; i < n; i++ {
          f[fruits[i]]++

          for j <= i && len(f) == 3 {
              f[fruits[j]]--
              if f[fruits[j]] == 0 {
                  delete(f, fruits[j])
              }
              j++
          }

          if res < i-j+1 {
              res = i - j + 1
          }
      }

      return res
  }
#+end_src

#+RESULTS:
: 4

* 76. 最小覆盖子串

#+begin_src go :main no
  package main

  import (
      "fmt"
      "math"
  )

  func main() {
      fmt.Println(minWindow("a", "aa"))
  }

  func minWindow(s string, t string) string {
      ori, cnt := map[byte]int{}, map[byte]int{}

      slen := len(s)
      dis := math.MaxInt32
      ansl, ansr := -1, -1

      for i := 0; i < len(t); i++ {
          ori[t[i]]++
      }

      check := func() bool {
          for k, v := range ori {
              if cnt[k] < v {
                  return false
              }
          }

          return true
      }

      for l, r := 0, 0; r < slen; r++ {
          if r < slen && ori[s[r]] > 0 {
              cnt[s[r]]++
          }

          for check() && l <= r {

              if r-l+1 < dis {
                  dis = r - l + 1
                  ansl = l
                  ansr = r + 1
              }

              if _, ok := ori[s[l]]; ok {
                  cnt[s[l]]--
              }
              l++
          }
      }

      if ansl == -1 {
          return ""
      }

      return s[ansl:ansr]
  }
#+end_src

#+RESULTS:
